# Rotation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..Rotation Property
Viewport Class See Also
---
The rotation of the viewport on the sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ViewportRotation Rotation { get; set; }
```

Visual Basic
---
```text
Public Property Rotation As ViewportRotation
	Get
	Set
```

Visual C++
---
```text
public:
property ViewportRotation Rotation {
	ViewportRotation get ();
	void set (ViewportRotation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace